app/views/events/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
<h1>Welcome, <%= User.find(session[:user_id]).first_name %></h1>