app/controllers/events_controller.rb

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "locations".* FROM "locations"  ORDER BY "locations"."id" ASC LIMIT 1
---
  def index
    @local_events = Location.all.where("state = ?",current_user.location.state)
    @outside_events =  Location.all.where.not("state = ?",current_user.location.state)

SELECT "locations".* FROM "locations" WHERE (location = 'San Francisco' AND state = 'CA')
SELECT COUNT(*) FROM "locations" WHERE (location = 'San Francisco' AND state = 'CA')
INSERT INTO "events" ("name", "date", "location_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "BAllin"], ["date", "0003-01-03"], ["location_id", 4], ["user_id", 1], ["created_at", "2016-02-17 01:23:16.942294"], ["updated_at", "2016-02-17 01:23:16.942294"]]
INSERT INTO "locations" ("location", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["location", "San Francisco"], ["state", "CA"], ["created_at", "2016-02-17 01:21:06.527846"], ["updated_at", "2016-02-17 01:21:06.527846"]]
INSERT INTO "relations" ("user_id", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["event_id", 3], ["created_at", "2016-02-17 06:53:43.812196"], ["updated_at", "2016-02-17 06:53:43.812196"]]
---
  def create
    @location = Location.where("location = ? AND state = ?", params[:event][:location], params[:event][:state])
    unless @location.any?
      @location = Location.create(location_params)
    end
    @event = Event.create(event_params)
    Relation.create(user: current_user,event: @event)