app/controllers/users_controller.rb

  def create
    @location = Location.where("location = ? AND state = ?", params[:user][:location], params[:user][:state])

    unless @location.any?
      @location = Location.create(location_params)
---
SELECT "locations".* FROM "locations" WHERE (location = 'Santa Rosa' AND state = 'CA')
SELECT COUNT(*) FROM "locations" WHERE (location = 'Santa Rosa' AND state = 'CA')
INSERT INTO "locations" ("location", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["location", "Santa Rosa"], ["state", "CA"], ["created_at", "2016-02-16 23:53:54.669175"], ["updated_at", "2016-02-16 23:53:54.669175"]]
INSERT INTO "users" ("first_name", "last_name", "email", "location", "state", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)